Revit 2026 API

# ConnectorElementChangeHostReference(Reference, Edge) Method

---

Changes the connector host reference to a new planar face and a new edge loop.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ChangeHostReference(
	Reference planarFace,
	Edge edge
)
```
```vb
Public Sub ChangeHostReference (
	planarFace As Reference,
	edge As Edge
)
```
```cpp
public:
void ChangeHostReference(
	Reference^ planarFace,
	Edge^ edge
)
```
```fsharp
member ChangeHostReference :
        planarFace : Reference *
        edge : Edge -> unit
```

#### Parameters

planarFace Reference
     The planar face to place the connector on.
edge Edge
     One of the edges in the edge loop that defines the new connector location on the planar face.

| Exception | Condition |
| --- | --- |
| ArgumentException | The face is not a planar face. -or- The edge is not on the planar face. |
| ArgumentNullException | A non-optional argument was null |

The connector referenced by an edge loop has the fixed origin as defined by the edge loop.

#### Reference

ConnectorElement Class

ChangeHostReference Overload

Autodesk.Revit.DB Namespace